quicksaver-api/app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "updated_at", "user_discount_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-12-13 19:18:04.292637"], ["updated_at", "2019-12-13 19:18:04.292637"], ["user_discount_id", 1]]
SELECT  "user_discounts".* FROM "user_discounts" WHERE "user_discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_discounts".* FROM "user_discounts" WHERE "user_discounts"."user_id" = $1  [["user_id", 1]]
SELECT  "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @like = Like.new(user_discount_id: params[:user_discount_id])
    @like.save
    user_discount = UserDiscount.find(params[:user_discount_id])
    user_discounts = UserDiscount.where(:user_id => user_discount.user_id).map { |itm|
      d = Discount.find(itm.discount_id)

SELECT  "user_discounts".* FROM "user_discounts" WHERE "user_discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
SELECT "user_discounts".* FROM "user_discounts" WHERE "user_discounts"."user_id" = $1  [["user_id", 1]]
SELECT  "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    user_discount = UserDiscount.find(@like.user_discount_id)
    @like.destroy

    user_discounts = UserDiscount.where(:user_id => user_discount.user_id).map { |itm|
      d = Discount.find(itm.discount_id)

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_like
      @like = Like.find(params[:id])