quicksaver-api/app/controllers/user_last_catagories_controller.rb

  def create
    puts params
    if params[:last_catagory_id].kind_of?(Array)
      for i in params[:last_catagory_id] do
        @user_last_catagory = UserLastCatagory.new(user_id: params[:user_id], last_catagory_id: i)
        @user_last_catagory.save
      end
    else
      @user_last_catagory = UserLastCatagory.new(user_id: params[:user_id], last_catagory_id: params[:last_catagory_id])
    end

    if @user_last_catagory.save
      last_catagories = UserLastCatagory.where(:user_id => params[:user_id])
      selected_catagories = last_catagories.map { |cat|
---
INSERT INTO "user_last_catagories" ("created_at", "updated_at", "user_id", "last_catagory_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-12-12 19:53:16.228037"], ["updated_at", "2019-12-12 19:53:16.228037"], ["user_id", 1], ["last_catagory_id", 2]]
INSERT INTO "user_last_catagories" ("created_at", "updated_at", "user_id", "last_catagory_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-12-12 22:48:03.910915"], ["updated_at", "2019-12-12 22:48:03.910915"], ["user_id", 1], ["last_catagory_id", 1]]
SELECT "user_last_catagories".* FROM "user_last_catagories" WHERE "user_last_catagories"."user_id" = $1  [["user_id", 1]]
SELECT  "last_catagories".* FROM "last_catagories" WHERE "last_catagories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    puts params
    user_id = 0
    arr = params[:id].split(',')
    if arr.kind_of?(Array)
      for i in arr do
        @user_last_catagory = UserLastCatagory.find(i.to_i)
        user_id = @user_last_catagory.user_id
        @user_last_catagory.destroy
      end
    else
      user_id = @user_last_catagory.user_id
      @user_last_catagory.destroy
    end

    if user_id
      last_catagories = UserLastCatagory.where(:user_id => user_id)
      selected_catagories = last_catagories.map { |cat|
---
SELECT  "last_catagories".* FROM "last_catagories" WHERE "last_catagories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "user_last_catagories".* FROM "user_last_catagories" WHERE "user_last_catagories"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "user_last_catagories" WHERE "user_last_catagories"."id" = $1  [["id", 30]]
SELECT "user_last_catagories".* FROM "user_last_catagories" WHERE "user_last_catagories"."user_id" = $1  [["user_id", 1]]

    def set_user_last_catagory
      @user_last_catagory = UserLastCatagory.find(params[:id])
---
SELECT  "user_last_catagories".* FROM "user_last_catagories" WHERE "user_last_catagories"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]