quicksaver-api/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "e@email.com"], ["LIMIT", 1]]
SELECT "user_last_catagories".* FROM "user_last_catagories" WHERE "user_last_catagories"."user_id" = $1  [["user_id", 1]]
SELECT  "last_catagories".* FROM "last_catagories" WHERE "last_catagories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "catagories".* FROM "catagories"
SELECT "sub_catagories".* FROM "sub_catagories" WHERE "sub_catagories"."catagory_id" = $1  [["catagory_id", 1]]
SELECT "last_catagories".* FROM "last_catagories" WHERE "last_catagories"."sub_catagory_id" = $1  [["sub_catagory_id", 1]]
---
  def login
    @user = User.find_by(email: params[:email])

    if @user && @user.authenticate(params[:password])

      last_catagories = UserLastCatagory.where(:user_id => @user.id)
      selected_catagories = last_catagories.map { |cat|
        cat.to_json(:include => [ {
          :last_catagory => {:include => {
          :sub_catagory => { :include => :catagory }
          } }
        }])
      }

      all_catagories = Catagory.all.map { |cat|
        {
          id: cat.id,
          name: cat.name,
          created_at: cat.created_at,
          updated_at: cat.updated_at,
          sub_catagories: SubCatagory.where(:catagory_id => cat.id).map { |sub_cat|
            {
              id: sub_cat.id,
              catagory_id: sub_cat.catagory_id,
              name: sub_cat.name,
              created_at: sub_cat.created_at,
              updated_at: sub_cat.updated_at,
              last_catagories: LastCatagory.where(:sub_catagory_id => sub_cat.id)

SELECT "user_discounts".* FROM "user_discounts" WHERE "user_discounts"."user_id" = $1  [["user_id", 1]]
SELECT  "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        }
      }

      user_discounts = UserDiscount.where(:user_id => @user.id).map { |itm|
        d = Discount.find(itm.discount_id)

SELECT "catagories".* FROM "catagories"
SELECT "sub_catagories".* FROM "sub_catagories" WHERE "sub_catagories"."catagory_id" = $1  [["catagory_id", 1]]
INSERT INTO "users" ("full_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "discounts".* FROM "discounts"
INSERT INTO "user_discounts" ("created_at", "updated_at", "user_id", "discount_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-02-18 02:20:32.971351"], ["updated_at", "2020-02-18 02:20:32.971351"], ["user_id", 1], ["discount_id", 1]]
---
  def create
    @user = User.new(email: params[:email], password: params[:password], full_name: params[:full_name])
    all_catagories = Catagory.all.map do |cat|
      {
        id: cat.id,
        name: cat.name,
        created_at: cat.created_at,
        updated_at: cat.updated_at,
        sub_catagories: SubCatagory.where(:catagory_id => cat.id).map { |sub_cat|
          {
            id: sub_cat.id,
            catagory_id: sub_cat.catagory_id,
            name: sub_cat.name,
            created_at: sub_cat.created_at,
            updated_at: sub_cat.updated_at,
            last_catagories: LastCatagory.where(:sub_catagory_id => sub_cat.id)
          }
        }
      }
    end

    if @user.save
      user_discounts = Discount.all.map { |d|
        itm = UserDiscount.create(user_id: @user.id, discount_id: d.id)

UPDATE "users" SET "img_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["img_url", "https://quiksaver.s3.amazonaws.com/otPknEhfb6Egi8oDNNFEQD.jpeg"], ["updated_at", "2020-02-18 02:56:42.892249"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "l@l.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$3KM7A0cRoNMJ4pfoVflUtOflsfudVNJz2F641/el0u1Ja1jh9oBQq"], ["updated_at", "2019-12-06 23:02:33.078711"], ["id", 8]]
---
  def send_password_reset
    @user = User.find_by(email: params[:email])
    if @user
      @user.update_attribute(:reset_password, true)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "wellington.vicioso@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "reset_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["reset_password", false], ["updated_at", "2019-12-06 23:39:59.570543"], ["id", 9]]
---
  def reset_password
    @user = User.find_by(email: params[:email])
    @user.update_attribute(:password,  params[:password])